//手动输入赛马娘及支援卡的ID
var saimaniangID = "ma100301"
var zhiyuanka1ID = "ka30022"
var zhiyuanka2ID = "ka30008"
var zhiyuanka3ID = "ka20002"
var zhiyuanka4ID = "ka30028"
var zhiyuanka5ID = "ka20001"
var zhiyuanka6ID = "ka30033"

//手动输入截取区域
var clip_start_x=170
var clip_start_y=482
var clip_weigth=320
var clip_hight=40

//定义本地存储文件
var 赛马娘事件=赛马娘事件_storage()
var 支援卡事件=支援卡事件_storage()
//运行主函数
main(saimaniangID,zhiyuanka1ID,zhiyuanka2ID,zhiyuanka3ID,zhiyuanka4ID,zhiyuanka5ID,zhiyuanka6ID,clip_start_x,clip_start_y,clip_weigth,clip_hight)

//灰度计算函数
function getGray(a,b,c){
    var tem
    if(a<=b){
        tem = a
        a = b
        b = tem
    }
    if(a<=c){
        tem = a
        a = c
        c = tem
    }
    if(b<=c){
        tem = b
        b = c
        c = tem
    }
    return (a+c)/2
}

//比较hash值
function compare(Str,flag,hash){
    //注意比较，获得相同值的个数
    for (b = 0;b<Str.length;b++){
        exm = Str[b][0]
        var num =0
        for(a=0;a<81;a++){
            if(exm[a]==hash[a]){
                num = num + 1;
            }
        }       
        //计算相似度
        var similarity = num/81
        //相似度>0.9输出对应文本
        if(similarity>0.9){
            console.clear()
            for(x=1;x<Str[b].length;x++){
                console.log(Str[b][x])
            }
            flag=1;
        }
    }
    return flag;
}

//定义主函数
function main(yuchengsaimaniang,zhiyuanka1,zhiyuanka2,zhiyuanka3,zhiyuanka4,zhiyuanka5,zhiyuanka6,clip_start_x,clip_start_y,clip_weigth,clip_hight){
    //请求截图命令，请求一次本次运行不必再请求
    if(!requestScreenCapture()){
        toast("请求截图失败");
        exit();
    }
    sleep(500)
    //开始循环，死循环
    while (true){
        //截取屏幕图片
        var img = captureScreen();
        //显示控制台
        console.show()
        console.setSize(device.width, device.height/4)
        console.setPosition(0, 440)
        //裁剪所需位置的屏幕图片
        var img_clip = images.clip(img, clip_start_x, clip_start_y, clip_weigth,clip_hight)
        //对裁剪之后的图片进行缩放
        var img_clip_resize = images.resize(img_clip, [10,9])
        //定义hash数组，计算方式为左边坐标的灰度值大于等于右边其值为1.否则为0
        var hash = new Array    //声明hash数组
        var gray_pre = 0        //初始化前一步的灰度值
        var k                   //将0，1存储到数组里的指示符
        for (i = 0;i < 9;i++){
            for(j = 0;j < 10;j++){
                var col = images.pixel(img_clip_resize,i,j) //获取当前像素的颜色
                var red = colors.red(col)       //获取当前像素的red通道值
                var green = colors.green(col)   //获取当前像素的green通道值
                var blue = colors.blue(col)     //获取当前像素的blue通道值
                var gray = getGray(red,green,blue)  //计算当前像素的灰度值，计算公式为三原色中最大和最小值的平均数
                //存储hash数组
                if(j>0){
                    k=i*9+j-1
                    if(gray_pre-gray>=0){
                        hash[k]=1
                    }else{
                        hash[k]=0
                    }
                }
                gray_pre=gray
            }
        }
        var flag = 0;
        var 赛马娘 = 赛马娘事件.get(yuchengsaimaniang) 
        flag = compare(赛马娘,flag,hash)
        var 支援卡1 = 支援卡事件.get(zhiyuanka1)
        flag = compare(支援卡1,flag,hash)
        var 支援卡2 = 支援卡事件.get(zhiyuanka2)
        flag = compare(支援卡2,flag,hash)
        var 支援卡3 = 支援卡事件.get(zhiyuanka3)
        flag = compare(支援卡3,flag,hash)
        var 支援卡4 = 支援卡事件.get(zhiyuanka4)
        flag = compare(支援卡4,flag,hash)
        var 支援卡5 = 支援卡事件.get(zhiyuanka5)
        flag = compare(支援卡5,flag,hash)
        var 支援卡6 = 支援卡事件.get(zhiyuanka6)
        flag = compare(支援卡6,flag,hash)
        toast("本轮结束")
        sleep(3000)
    }
}

function 赛马娘事件_storage(){
    var 赛马娘事件 = storages.create("赛马娘事件");

    //100301东海帝皇01
    var カラオケでパワーアップ = [[1,0,0,1,0,1,0,1,0,0,1,0,1,0,0,1,1,0,1,1,1,0,0,0,1,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,0,0,1,0,1,1,0,1,0,1,0,1,1,0,1,0,1,1,0,1,0,1,0,0,1,0,0,0,1,0,1,0,1,0,0,1,1,0,1,0,1],"1、根性(根)+10","2、スピード(速)+10"]
    var ダンスレッスン = [[1,0,0,1,0,1,0,1,0,1,1,1,1,0,0,1,1,0,1,1,1,0,0,0,1,1,0,1,0,0,1,0,1,1,1,0,1,0,1,0,0,1,0,1,0,0,0,0,1,1,0,0,1,0,0,1,1,1,0,0,1,1,0,1,1,1,0,0,1,0,0,0,0,0,0,1,0,1,0,1,0],"1、スタミナ(耐)+10","2、パワー(力)+10"]
    var テイオーのジンクス = [[0,1,1,0,0,0,0,1,0,1,1,0,0,1,1,0,1,1,1,1,1,1,0,1,0,1,1,0,1,1,0,0,1,0,1,0,0,0,1,0,1,0,1,1,1,1,0,0,0,0,1,0,0,0,1,1,1,1,0,1,0,0,1,1,1,0,0,0,1,0,1,0,0,1,1,0,1,0,1,0,1],"1、スタミナ(耐)+20","2、賢さ（智）+20"]
    var カイチョーみたいな勝負服 = [[0,1,1,0,0,0,0,1,0,1,1,0,0,0,1,0,0,0,1,1,1,1,0,0,1,0,0,0,1,1,0,1,0,1,0,0,0,1,0,0,0,1,0,1,1,1,0,1,0,1,0,1,0,1,1,1,1,1,0,0,1,0,1,1,0,1,0,1,0,1,0,1,0,1,0,0,1,1,0,1,0],"1、スピード(速)+10，賢さ(智)+10，概率获得『注目株』","2、スタミナ(耐)+10，根性(根)+10，随机获得『注目株』"]
    var 追加の自主トレ = [[1,0,0,1,0,1,0,1,0,0,1,0,0,0,1,0,1,0,0,1,1,0,0,1,0,1,0,0,1,1,0,0,1,0,1,0,0,1,1,0,0,0,1,1,0,0,1,1,0,0,1,0,1,0,0,1,1,0,1,0,0,1,0,1,1,0,0,0,1,1,0,0,0,0,0,1,1,0,0,1,0],"1、体力-5,当前训练对应属性+5,秋川理事长的羁绊+5","2、体力+5"]
    var 新年の抱負 = [[1,0,0,1,0,1,0,1,0,0,1,0,0,1,1,0,1,0,1,1,1,0,1,1,0,1,0,1,0,1,0,0,1,0,1,0,0,1,1,0,0,1,0,1,0,1,1,1,0,0,1,0,1,0,0,1,1,0,1,1,0,1,0,1,0,0,0,0,1,0,1,0,0,0,1,1,1,0,0,1,0],"1、根性(根)+10","2、体力+20","3、Pt+20"]
    var レース勝利 = [[1,0,0,1,0,1,0,1,0,1,0,1,0,0,1,1,1,0,1,0,1,0,0,1,1,1,0,1,1,0,0,0,1,0,1,0,0,1,1,0,0,1,0,1,0,1,0,0,0,1,1,0,1,0,1,0,1,1,0,1,0,1,0,1,0,1,1,0,1,0,1,0,0,1,0,0,1,0,0,1,0],"1、体力-15,スピード(速)+5，Pt+30※上升值随机","2、体力-5~20，随机属性+5~10，Pt+30~45"]
    var わがままテイオーと思い出の景色 = [[0,1,1,0,1,0,0,1,0,1,1,0,0,1,0,0,1,0,1,0,1,0,0,1,1,1,0,0,1,1,0,1,1,1,0,1,0,1,0,0,1,0,0,1,1,1,0,1,0,0,0,0,1,0,1,0,1,1,0,1,1,0,0,1,1,0,0,1,0,1,0,1,0,1,1,0,1,1,0,1,0],"1、根性(根)+20","2、スピード(速)+10，パワー(力)+10"]
    var 夏合宿2年目にて = [[1,0,0,1,0,1,0,1,0,1,0,1,0,1,1,0,1,0,1,0,1,1,0,1,0,1,0,0,1,0,1,0,1,0,1,1,1,0,1,0,1,0,0,1,0,1,1,1,1,0,1,0,1,0,1,1,1,1,0,1,0,1,0,1,1,1,0,1,0,0,1,0,0,0,0,1,0,1,1,0,1],"1、パワー(力)+10","2、根性(根)+10"]
    var 力のヒミツ = [[1,0,0,1,0,1,0,1,0,1,0,1,1,0,0,1,1,0,0,1,1,0,0,1,1,1,0,0,1,1,1,0,1,0,1,0,1,0,1,0,0,1,0,1,0,1,1,1,1,1,0,0,1,0,0,1,1,0,1,0,0,1,0,0,1,0,0,0,1,0,1,0,1,0,0,1,0,1,0,1,0],"1、体力+10，PT+5","2、体力+30，Pt+10，概率获得以下效果：速度-5，获得『太り気味』"]
    var テイオーの武者修行 = [[1,0,0,1,0,1,0,1,0,1,0,0,1,0,0,0,0,1,1,0,1,0,0,1,1,0,1,1,0,1,0,0,1,1,1,0,0,1,0,0,0,1,0,1,1,0,1,1,1,0,1,1,0,1,1,0,1,1,0,0,1,0,1,1,1,0,0,1,0,0,1,1,0,0,0,1,1,1,1,0,0],"1、根性(根)+10，PT+15","2、『抜け出し準備』hint等级+1"]
    var レース入着 = [[1,0,0,1,0,1,0,1,0,1,0,1,1,0,1,0,1,0,1,0,1,0,0,1,0,1,0,1,1,0,1,0,1,0,1,0,0,1,1,0,0,1,0,1,0,1,0,0,1,0,1,0,1,0,1,0,1,0,0,1,0,1,0,1,0,1,0,0,1,0,1,0,0,1,0,1,1,0,0,1,0],"1、体力-20，随机属性+4~8，Pt+30","2、体力-5~30，随机属性+4~8，Pt+30"]
    var 初詣 = [[1,0,0,1,0,1,0,1,0,0,1,0,1,0,1,0,1,0,1,1,1,0,0,1,0,1,0,1,1,0,1,1,0,0,1,0,1,1,1,0,0,1,0,1,0,1,1,0,1,0,1,0,1,0,0,1,0,1,0,1,0,1,0,0,1,1,0,0,1,0,1,0,1,0,0,1,0,1,0,1,0],"1、体力+30","2、全属性+5","3、Pt+35"]
    var お大事に = [[1,0,0,1,0,1,0,1,0,1,0,1,0,1,1,0,1,0,1,0,1,0,1,1,0,1,0,0,1,1,1,0,0,0,1,0,1,0,1,0,0,1,0,1,0,1,0,1,1,0,1,0,1,0,0,1,1,0,1,1,0,1,0,1,1,0,0,1,1,0,1,0,0,0,0,1,0,1,0,1,0],"1、干劲下降，当前训练对应属性-5","2、パワー(力)+5，调查中"]
    var 無茶は厳禁に = [[0,0,0,1,0,1,0,1,0,1,1,1,0,0,1,1,1,0,1,1,1,0,0,1,1,1,0,1,0,1,1,0,1,0,1,0,0,1,1,0,1,1,0,1,0,1,1,1,0,0,1,0,1,0,0,1,1,1,0,1,0,1,0,1,0,1,0,0,1,0,1,0,0,1,0,1,1,0,0,1,0],"1、体力+10，干劲下降，当前训练对应属性-10，随机两种能力-10，概率获得『練習ベタ』","2、成功时：体力+10，获得『練習上手◯』\n\t失败时：当前训练对应属性-10，随机两种能力-10，获得『練習ベタ』"]
    var テイオーウマドルになる = [[1,0,0,1,0,0,0,1,0,1,0,0,1,0,1,0,1,0,1,0,1,1,0,0,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,0,1,0,0,0,1,0,1,1,1,0,0,1,1,0,1,0,1,1,0,0,0,1,1,1,1,0,0,0,1,0,1,1,0,1,0,1,0,1,1,0,0],"1、パワー+10","2、スピード+10"]
    var ボクとマヤノとオトナの時間 = [[1,0,0,1,0,0,0,1,0,1,0,0,0,1,0,1,1,0,1,1,0,0,0,0,1,0,0,0,1,0,1,0,1,0,1,0,0,1,1,0,0,1,0,0,0,1,0,1,1,1,0,1,0,0,1,0,1,1,1,0,0,1,0,0,1,0,0,0,1,0,1,0,1,0,0,1,0,1,1,0,1],"1、根性+10","2、賢さ+10"]

    var 东海帝皇 = [カラオケでパワーアップ,ダンスレッスン,テイオーのジンクス,カイチョーみたいな勝負服,追加の自主トレ,
                    新年の抱負,レース勝利,わがままテイオーと思い出の景色,夏合宿2年目にて,力のヒミツ,
                    テイオーの武者修行,レース入着,初詣,お大事に,無茶は厳禁に,
                    テイオーウマドルになる,ボクとマヤノとオトナの時間];
    赛马娘事件.put("ma100301", 东海帝皇);

    return 赛马娘事件;
}

function 支援卡事件_storage(){
    var 支援卡事件 = storages.create("支援卡事件");

    //双涡轮 ターボエンジン全開宣言
    var 怖くないもん = [[1,0,1,0,1,1,0,0,1,1,1,0,1,1,1,0,1,1,1,0,1,1,0,1,0,1,1,0,1,1,1,1,0,0,1,1,0,1,1,0,0,1,0,1,1,0,0,1,0,0,1,1,1,1,1,0,1,0,0,1,1,0,1,1,1,0,1,0,0,1,0,1,1,1,0,0,1,1,0,0,1],"1、スピード(速)+10，体力随机-10，双涡轮的羁绊随机+5\n\t※成功后会发生下次事件，失败时体力减少","2、体力+20\n\t※不会发生下次事件"]

    var ターボエンジン全開宣言 = [怖くないもん];
    支援卡事件.put("ターボエンジン全開宣言", ターボエンジン全開宣言);

    //目白麦昆『エース』として
    var 高みに至る為 = [[1,0,1,0,1,1,0,0,1,0,1,1,0,1,1,1,0,1,0,1,1,0,0,0,1,0,1,1,0,1,0,1,0,1,0,1,0,1,1,0,0,1,1,0,1,1,0,1,0,0,1,1,0,1,1,1,1,0,0,1,1,0,1,0,1,1,0,1,0,1,0,1,1,0,0,1,0,1,0,0,1],"1、スタミナ+5，根性+5，目白麦昆羁绊+5","2、『先駆け』hint等级+1，目白麦昆羁绊+5"]

    var エースとして = [高みに至る為];
    支援卡事件.put("ka30022", エースとして);
    //星云天空 待望の大謀
    var ゆる募ネコの捕まえ方 = [[1,0,1,0,1,1,0,0,1,0,0,1,1,1,0,0,1,1,1,1,1,1,0,0,1,1,0,1,0,1,1,0,0,0,1,1,0,1,1,1,1,0,1,0,1,1,0,1,1,0,1,1,0,1,0,1,1,1,0,0,1,0,1,0,1,1,0,1,0,0,0,1,1,0,0,0,1,1,1,1,1],"1、体力+10，賢さ(智)+5，星云天空羁绊+5","2、体力-10，スピード(速)+15，スタミナ(耐)+5，星云天空羁绊+5"]
    var ご利用は戦略的に = [[1,0,1,0,1,1,0,0,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,0,1,1,0,1,1,0,0,1,1,1,0,0,1,1,1,0,1,0,1,1,0,1,1,0,0,0,1,0,1,1,0,1,0,1,1,0,0,1,1,0,1,1,0,1,1,1,1,0,1,0,0,1,1,0,0,0],"1、体力+10，賢さ(智)+5，星云天空羁绊+5","2、Pt+30，『二の矢』hint等级+1，星云天空羁绊-5"]


    var 待望の大謀 = [ゆる募ネコの捕まえ方,ご利用は戦略的に];
    支援卡事件.put("ka30008", 待望の大謀);

    //大和赤骥 努力は裏切らない
    var 明日は私が勝つんだから = [[1,0,1,0,0,1,0,0,1,0,1,1,1,0,0,1,0,0,1,1,1,0,0,0,1,1,0,1,1,1,1,0,1,1,1,0,1,1,1,0,0,1,1,0,1,1,1,1,0,0,0,1,0,0,1,1,1,0,1,0,0,1,1,0,1,1,0,1,0,1,0,1,1,0,0,1,0,1,0,0,1],"1、賢さ(智)+10，大和赤骥羁绊+5","2、干劲提升，PT+15，大和赤骥羁绊+5"]


    var 努力は裏切らない = [明日は私が勝つんだから];
    支援卡事件.put("ka20002", 努力は裏切らない);

    //北部玄驹 迫る熱に押されて
    var 情けは人のためならず = [[1,0,1,0,1,1,0,0,1,0,1,1,1,1,1,0,0,1,0,1,1,1,0,1,0,1,1,0,1,1,1,0,1,0,1,1,0,1,1,1,0,1,0,1,0,0,1,1,1,0,1,0,0,1,0,1,1,0,0,1,1,0,1,0,1,1,0,1,0,1,0,0,1,1,0,1,0,1,0,1,1],"1、体力+10，干劲提升，北部玄驹羁绊+5","2、『直線巧者』hint等级+1，北部玄驹羁绊+5"]
    var あぁ友情 = [[1,0,1,0,1,1,0,0,1,1,1,0,0,0,1,1,0,1,1,1,0,0,0,1,1,0,1,1,1,0,1,0,1,1,0,1,1,1,0,0,0,1,0,0,1,1,1,1,1,0,1,1,0,1,0,0,1,0,0,1,1,0,1,1,1,1,0,0,1,1,0,1,0,0,0,1,1,0,0,0,1],"1、干劲提升，力量+5，北部玄驹羁绊+5","2、体力+10，北部玄驹羁绊+5"]

    var 迫る熱に押されて = [情けは人のためならず,あぁ友情];
    支援卡事件.put("ka30028", 迫る熱に押されて);

    //富士奇迹 やれやれ、お帰り
    var スライハンド = [[1,0,1,0,1,1,0,0,1,0,1,0,1,1,0,1,0,1,1,1,0,1,1,0,1,0,1,0,1,0,1,0,1,0,0,1,0,0,1,1,0,1,1,0,1,1,0,1,0,0,0,1,0,1,1,1,0,0,1,1,0,0,1,0,1,0,0,1,1,1,0,1,1,1,0,1,0,1,0,0,1],"1、賢さ(智)+5，Pt+15，富士奇迹羁绊+5","2、パワー(力)+5，Pt+15，富士奇迹羁绊+5"]


    var やれやれお帰り = [スライハンド];
    支援卡事件.put("ka20001", やれやれお帰り);

    //微光飞驹 トレセン学園
    var 必殺技を手に入れろ = [[1,0,1,0,0,1,0,0,1,1,1,1,1,0,1,0,1,0,0,1,1,1,1,0,1,1,1,1,1,1,0,0,1,0,1,1,1,1,1,0,1,1,0,1,0,1,1,1,1,0,1,0,1,1,1,1,0,0,1,0,1,0,1,0,1,1,0,1,0,1,0,0,0,1,0,0,0,1,0,1,1],"1、『短距離直線◯』hint等级+1，微光飞驹羁绊+5","2、体力+30，微光飞驹羁绊+5"]

    var 微光飞驹トレセン学園 = [スライハンド];
    支援卡事件.put("ka10042", 微光飞驹トレセン学園);

    //胜利奖券 夢はホントに叶うんだ

    var 夢はホントに叶うんだ = [スライハンド];
    支援卡事件.put("ka30033", 夢はホントに叶うんだ);

    return 支援卡事件;
}




